src/InformationRegisters/ВерсииКонфигурацийИБ/ВерсииКонфигурацийИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииКонфигурацийИБ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ВерсииКонфигураций/ВерсииКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииКонфигураций</name>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>CatalogRef.РедакцииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РелизОтозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URLИнфо</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/РедакцииКонфигураций/РедакцииКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РедакцииКонфигураций</name>
  <attributes>
    <name>ВидКонфигурации</name>
    <type>
      <types>CatalogRef.ВидыКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФильтрВерсий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ВерсииКонфигураций/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьЭлемент(ВидКонфигурации, Версия) Экспорт

	Ссылка = НайтиЭлемент(ВидКонфигурации, Версия);
	Если Ссылка.Пустая() Тогда
		Ссылка = СоздатьЭлемент(ВидКонфигурации, Версия);
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция НайтиЭлемент(ВидКонфигурации, Версия) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииКонфигураций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВерсииКонфигураций КАК ВерсииКонфигураций
		|ГДЕ
		|	ВерсииКонфигураций.ВидКонфигурации = &ВидКонфигурации
		|	И ВерсииКонфигураций.Наименование = &Версия
		|	И НЕ ВерсииКонфигураций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВидКонфигурации", ВидКонфигурации);
	Запрос.УстановитьПараметр("Версия", Версия);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВерсииКонфигураций.ПустаяСсылка();
	
КонецФункции

Функция СоздатьЭлемент(ВидКонфигурации, Версия, Редакция = Неопределено, URLИнфо = "", ДатаВыхода = Неопределено) Экспорт
	
	Если ДатаВыхода = Неопределено Тогда
		ДатаВыхода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Объект = Справочники.ВерсииКонфигураций.СоздатьЭлемент();
	Объект.ВидКонфигурации = ВидКонфигурации;
	Объект.Наименование = Версия;
	Объект.ДатаВыхода = ДатаВыхода;
	
	Объект.Редакция = Редакция;
	Объект.URLИнфо = URLИнфо;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции


Функция Актуальная(ВидКонфигурации, Редакция = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВерсииКонфигураций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВерсииКонфигураций КАК ВерсииКонфигураций
		|ГДЕ
		|	ВерсииКонфигураций.ВидКонфигурации = &ВидКонфигурации
		|	И ВерсииКонфигураций.Редакция = &Редакция
		|	И НЕ ВерсииКонфигураций.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВерсииКонфигураций.ДатаВыхода УБЫВ";
	
	Запрос.УстановитьПараметр("ВидКонфигурации", ВидКонфигурации);
	Запрос.УстановитьПараметр("Редакция", ?(ЗначениеЗаполнено(Редакция), Редакция, Справочники.РедакцииКонфигураций.ПустаяСсылка()));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВерсииКонфигураций.ПустаяСсылка();
	
КонецФункции

Функция НомерАктуальной(ВидКонфигурации, Редакция = Неопределено) Экспорт
	
	Версия = Актуальная(ВидКонфигурации, Редакция);
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Версия, "Наименование");
	
КонецФункции

// Требует рефакторинг

Функция СоответствуетФильтруВерсий(Версия, ФильтрВерсий) Экспорт
	
	Если СтрЗаканчиваетсяНа(ФильтрВерсий, ".*") Тогда
		БазовыйФильтр = Лев(ФильтрВерсий, СтрДлина(ФильтрВерсий) - 2);
		ЧастиВерсии = СтрРазделить(Версия, ".");
		ЧастиФильтра = СтрРазделить(БазовыйФильтр, ".");
		Если ЧастиВерсии.Количество() < 3 Или ЧастиФильтра.Количество() <> 3 Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат ЧастиВерсии[0] = ЧастиФильтра[0]
		И ЧастиВерсии[1] = ЧастиФильтра[1]
		И ЧастиВерсии[2] = ЧастиФильтра[2];
	Иначе
		Возврат Версия = ФильтрВерсий;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВерсиюИБ(ИнформационнаяБаза) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииКонфигурацийИБСрезПоследних.Версия КАК Версия
		|ИЗ
		|	РегистрСведений.ВерсииКонфигурацийИБ.СрезПоследних КАК ВерсииКонфигурацийИБСрезПоследних
		|ГДЕ
		|	ВерсииКонфигурацийИБСрезПоследних.ИнформационнаяБаза = &ИнформационнаяБаза";
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Версия;
	КонецЕсли;
	
	Возврат Справочники.ВерсииКонфигураций.ПустаяСсылка();
	
КонецФункции

// Требует рефакторинг

#КонецОбласти
